{"shape_params": ["blue", "green", "cyan", "magenta", "yellow", "red"], "decoration": "logo", "notes": [{"start": 9, "notes": ["Move HP so it is to the left of Coca Cola.", "You'll be making a 3x2x2 rectangular base with an arch on top. You have most of the base already made. Place HP so its bottom face touches BMW's top face.", "HP should be west of Coca Cola.", "Put the HP block on the BMW block.", "Take the block nearest to the big rectangular pile, and put it in the upper left corner of the pile.", "Take the lone block that's a computer brand, and put it in the group, 2nd level, upper left corner.", "Place the hp block on top of the BMW block.", "Place the hp block to the left of the Coca Cola block.", "Place the hp block diagonal to the Burger King block."], "finish": 10, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 10, "notes": ["Move Toyota so it is to the left of Burger King.", "Place Toyota so its bottom face is on top of Stella Artois. You're done with the base.", "Toyota should be south of HP.", "Put the Toyota block on the Stella Artois block.", "Take the block nearest to the big rectangular pile, and put it in the lower left corner of the pile.", "Take the lone block that is a car brand, put it in the group, 2nd level, near left corner.", "Place the Toyota block on top of the Stella Artois block.", "Place the Toyota block to the left of the Burger King block.", "Place the Toyota block below the hp block."], "finish": 11, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 11, "notes": ["Move Starbucks so it is on top of the front half of SRI and the back half of Nvidia.", "Now you'll work on the arch. Place Starbucks so its front bottom edge is in the center of Nvidia's top face.", "Starbucks should be above and half a block length north of Nvidia.", "Put the Starbucks block so it's half on the SRI block and half on the nvidia block.", "Take the block nearest to the big rectangular pile, and put on top at the middle of the right edge.", "Take the lone block that is a coffee shop, put it on the group, starting a 3rd level,  centered on the right edge.", "Place the Starbucks block in the middle of the SRI and nvidia blocks.", "Place the Starbucks block on top of the nvidia block then move it slightly upwards.", "Move the Starbucks block to the right and move it down until it is in the middle of the nvidia and SRI blocks."], "finish": 12, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 12, "notes": ["Move Pepsi so it is on top of the front half of HP and the back half of Toyota.", "Place Pepsi so its front bottom edge is touching the center of Toyota's top face.", "Pepsi should be above and half a block length north of Toyota.", "Put the pepsi block so it's half on the hp block and half on the Toyota block, and shift it a hair to the right.", "Of the two nearest blocks to the pile, take the one farther from you, and put on top at the middle of the left edge of the pile.", "Take the lone block that is a soft drink, put it on the group, 3rd level, centered on the left edge.", "Place the Pepsi block in the middle of the hp and Toyota blocks.", "Place the Pepsi block on top of the Toyota block and move it slightly upwards.", "Move the Pepsi block to the right then down until it is in the middle of the hp and Toyota blocks."], "finish": 13, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 13, "notes": ["Move McDonalds so it is above and slightly to the right of Pepsi.", "Place McDonalds so its bottom left edge is slightly to the right of Pepsi's top left edge.", "McDonalds should be above and slightly east of Pepsi.", "Put the McDonald's block on the Pepsi block, but shifted about 1/4 block right.", "Take the block nearest to the lower left corner and put it on top of the left stack, but staggered 1/4 block to the right.", "Take the lone block that is a fast food restaurant, put it on the group, on top of the pepsi block, but nudge it so the tower leans right.", "Stagger the McDonalds block slightly to the right on top of the Pepsi Block.", "Place the McDonalds block on top of the Pepsi block to where the 'P' is still visible.", "Place the McDonalds block on top of the Pepsi block the slide it slightly to the right."], "finish": 14, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 14, "notes": ["Move Target so it is on top of and slightly to the left of Starbucks.", "Place Target so its bottom right edge is slightly to the left of Starbucks's top right edge.", "Target should be above and slightly west of Starbucks.", "Put the Target block on the Starbucks block, shifted 1/4 block left.", "Take the block nearest to you and put it on the right stack, but staggered 1/4 block left.", "Take the lone block that is a department store, put it on top of the starbucks block, but nudge it so the stack leans left.", "Stagger the Target block slightly to the left on top of the Starbucks block.", "Place the Target block on top of the Starbucks block then move it slightly to the left.", "Stagger the Target block to the left so the edge is still showing."], "finish": 15, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 15, "notes": ["Move Heineken so it is on top of and slightly to the right of McDonalds.", "Place Heineken so its bottom left edge is slightly to the right of McDonald's top left edge.", "Heineken should be above and slightly east of McDonalds.", "Put the Heineken block on the McDonald's block, shifted 1/4 block right.", "Take the block near the upper left corner and put it on the left hand tower, staggered 1/4 block right.", "Take the lone block that is a beer brand and put it on the left stack, continuing the rightward lean, so that its right edge is over the middle of the group.", "Stagger the Heineken block slightly to the right on top of the McDonalds block.", "Place the Heineken block on top of the McDonalds block and move it slightly to the right.", "Slide the Heineken block to where the edge is touching the beginning of the Target block."], "finish": 16, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 16, "notes": ["Move Adidas so it is above and slightly to the left of Target. Adidas should be to the right of Heineken. You've made an arch with a base.", "Place Adidas so its right face touches Heineken's left face. You're all done!", "Adidas should be above and slightly west of Target. Congratulations, you've made a weight with a magnet attached!", "Put the adidas block on the Target block, shifted 1/4 block left.", "Take the last lone block and put it on the right hand tower, shifted 1/4 block left, so it touches the top block on the left tower.", "Take the lone block that is a shoe brand, put it on the right tower, continuing the leftward lean so that its left edge is over the middle of the group and touches the left edge of the Heineken block.", "Place the Adidas block directly beside the Heineken block.", "Place the Adidas block on top of the Target block and move it slightly to the left.", "Make the Adidas block touch the Heineken block."], "finish": 17, "type": "A0", "users": ["A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A11THU6UGG3THR", "A11THU6UGG3THR", "A11THU6UGG3THR", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY", "A14UV8XLRVGXAY"]}, {"start": 0, "notes": ["Take the Mercedes Benz block and put it below the Shell block.", "Slide the Mercedes Benz block up until it touches the Shell block.", "Slide the Mercedes Benz block up until it is in the same horizontal row as the Adidas block.", "Below the Shell block, place the Mercedes Benz block.", "Place the Mercedes Benz block below the Shell block.", "Take the Mercedes Benz block and put it below the Shell block.", "mercedes block moves up directly below shell", "mercedes moves up to touch the bottom of the shell block directly in line with it", "mercedes moved so there is no gap between it and the shell block above"], "finish": 1, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 1, "notes": ["Slide the ESSO block up until its right side touches the Shell block's left side.", "Slide the ESSO block up until it is in the same horizontal line as the HP block and touching Shell.", "Slide the ESSO block up until its bottom right corner touches the top left corner of the Mercedes Benz block.", "To the left of the Shell block, place the Esso block.", "Place the Esso block to the left of the Shell block.", "Take the Esso block and put it left of the Shell block.", "esso block placed directly to the left of shell, touching it.", "esso moves up to be straight left of shell touching the side", "esoo moves directly to the left of shell on the same plane"], "finish": 2, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 2, "notes": ["Put the Texaco block so that it completes the square with the ESSO, Shell, Mercedes Benz blocks.", "Put the Texaco block to be in the same horizontal row as the Mercedes Benz block and the same vertical column as the ESSO block.", "Move the Texaco block so that its top right corner touches the bottom left corner of the Shell block.", "Below the Esso block, place the Texaco block.", "Place the Texaco block to the left of the Mercedes Benz block.", "Take the Texaco block and place it in the space below the Esso block and to the left of the Mercedes Benz block.", "start block is placed to round out the square", "star block moved up to the left of merceds to form a continuous square", "star block moved up and right to make a big square with esso, shell, and benz"], "finish": 3, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 3, "notes": ["Move the BMW block to the same row and touching the ESSO block.", "Move the BMW block until its bottom right corner touches the top left corner of the Texaco block.", "Slide the BMW block down until it is in the same horizontal row as the HP block and right as far as it will go.", "To the left of the Esso block, place the BMW block.", "Place the BMW block to the left of the Esso block.", "Take the BMW block and put it left of the Esso block.", "bmw placed to the direct left of esso", "bmw block directly touches the left side of esso block", "bmw moves down and slightly right to be even with and touching the left side of esso"], "finish": 4, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 4, "notes": ["Move the Stella Artois block until it makes a rectangle with the BMW, ESSO, Texaco, Shell, and Mercedes Benz blocks.", "Move the Stella Artois block until it is in the same horizontal row as the Adidas block and the same vertical column as the BMW block.", "Move the Stella Artois block until its top right corner touches the bottom left corner of the ESSO block.", "To the left of the Texaco block, place the Stella Artois block.", "Place the Stella Artois block to the left of the Texaco block.", "Take the Stella Artois block and put it left of the Texaco block.", "stella directly below bmw", "the stella block goes to the direct immediate left of the star one", "stella block moved to make the big square a rectangle"], "finish": 5, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 5, "notes": ["Put the SRI block on top of the Shell block.", "Move the SRI block to the same horizontal row as the HP block and the same vertical column as the Mercedes Benz block, but on the second level of blocks.", "Move the SRI block to be directly to the right of the ESSO block, but on the second level of blocks.", "On top of the Shell block, place the SRI block.", "Place the SRI block on top of the Shell block.", "Take the SRI block and put it on top of the Shell block.", "sri block placed right on top of shell", "sri block directly over shell", "sri block placed directly over shell completely covering it"], "finish": 6, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 6, "notes": ["Put the NVIDIA block on top of the Mercedes Benz block.", "Put the NVIDIA block directly down from the SRI block, but on the second level of blocks.", "Put the NVIDIA block in the same horizontal row as the Adidas block and the same vertical column as the SRI block, but on the second level of blocks.", "On top of the Mercedes Benz block, place the Nvidia block.", "Place the Nvidia block on top of the Mercedes Benz block.", "Take the Nvidia block and put it on top of the Mercedes Benz block.", "nvidia placed directly on top of merecedes", "nvidia block palced directly below the SRI one", "nvidia covers the  mercedes one"], "finish": 7, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 7, "notes": ["Put the Coca Cola block on top of the ESSO block.", "Put the Coca Cola block directly to the left of the SRI block, on the second level of blocks.", "Move the Coca Cola block so that its bottom right corner touches the top left corner of the NVIDIA block, on the second level of blocks.", "On top of the Esso block, place the Coca Cola block.", "Place the Coca Cola block on top of the Esso block.", "Take the Coca Cola block and put it on top of the Esso block.", "coca cola placed directly on top of esso", "cocacola to the direct left of sri", "coca cola on top of esso covering it completely"], "finish": 8, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}, {"start": 8, "notes": ["Put the Burger King block on top of the Texaco block.", "Put the Burger King block in the same horizontal row as the NVIDIA block and the same vertical column as the Coca Cola block, on the second level of blocks.", "Move the Burger King block so that its top right corner touches the bottom left corner of the SRI block, on the second level of blocks.", "On top of the Texaco block, place the Burger King block.", "Place the Burger King block on top of the Texaco block.", "Take the Burger King block and put it on top of the Texaco block.", "BK directly on top of the star block", "BK goes to the left of nvidia and under coca cola", "bk block completely covers star one"], "finish": 9, "type": "A0", "users": ["ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "ARYEH1BMQCKXQ", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF", "AT3S0S6E0M19G", "AT3S0S6E0M19G", "AT3S0S6E0M19G"]}], "rotations": [[[0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00041, 0.00018, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [0.0, 0.0, 0.0, 1.0], [-3e-05, -6e-05, 3e-05, 1.0], [0.0, 0.0, 0.0, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [-1e-05, 1e-05, 1e-05, 1.0], [-1e-05, 1e-05, 2e-05, 1.0], [-1e-05, -0.00041, 0.00017, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00012, 9e-05, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [0.0, -1e-05, 5e-05, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00041, 0.00018, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [0.0, 0.0, 0.0, 1.0], [-3e-05, -6e-05, 3e-05, 1.0], [0.0, 0.0, 0.0, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [-1e-05, 1e-05, 1e-05, 1.0], [-3e-05, -6e-05, 5e-05, 1.0], [-1e-05, -0.00041, 0.00017, 1.0], [0.0, 0.0, 0.0, 1.0], [4e-05, 2e-05, -4e-05, 1.0], [-1e-05, -0.00012, 9e-05, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [0.0, -1e-05, 5e-05, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00041, 0.00018, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [0.0, 0.0, 0.0, 1.0], [-0.0001, -3e-05, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [-5e-05, -0.00041, 0.00058, 1.0], [-1e-05, 1e-05, 1e-05, 1.0], [-1e-05, -5e-05, 0.0, 1.0], [-1e-05, -0.00041, 0.00017, 1.0], [0.0, 0.0, 0.0, 1.0], [7e-05, 1e-05, -0.0001, 1.0], [-1e-05, -0.00012, 9e-05, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [0.0, -1e-05, 5e-05, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00042, 0.0001, 1.0], [-1e-05, -0.00046, 0.00018, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00141, -0.00058, -0.00066, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00046, 0.00018, 1.0], [-2e-05, 1e-05, 7e-05, 1.0], [0.0, -7e-05, -3e-05, 1.0], [-2e-05, -0.0004, 0.0001, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00028, -6e-05, -0.00026, 1.0], [-1e-05, -0.00012, 0.00012, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [-0.00025, -0.00065, 0.00031, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-1e-05, 0.00364, 0.00065, 0.99999], [-1e-05, -0.00046, 0.00018, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00116, -0.00117, -0.00082, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00046, 0.00018, 1.0], [-2e-05, 1e-05, 7e-05, 1.0], [1e-05, -1e-05, -4e-05, 1.0], [-2e-05, -0.0004, 0.0001, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00036, -7e-05, -0.00033, 1.0], [-1e-05, -0.00012, 0.00012, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [9e-05, -0.00178, -0.00095, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-7e-05, 0.00414, 0.00035, 0.99999], [-1e-05, -0.00046, 0.00018, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00109, -0.00106, -0.00093, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00046, 0.00018, 1.0], [-2e-05, 1e-05, 7e-05, 1.0], [2e-05, 1e-05, -4e-05, 1.0], [-2e-05, -0.0004, 0.0001, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00043, -2e-05, -0.00041, 1.0], [-1e-05, -0.00012, 0.00012, 1.0], [0.0, 0.0, 0.0, 1.0], [-0.00029, 0.00184, 0.00047, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [0.00041, -0.0009, -0.00093, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [5e-05, 0.00426, 0.00013, 0.99999], [-2e-05, -0.00047, 0.00011, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00112, -0.00138, -0.00097, 1.0], [0.0, 0.0, 0.0, 1.0], [-2e-05, -0.00047, 0.00011, 1.0], [-2e-05, 0.0, 0.00013, 1.0], [-0.0031, 0.00074, 0.00035, 0.99999], [-2e-05, -0.0004, 0.00014, 1.0], [0.0, 0.0, 0.0, 1.0], [-0.00079, -0.00028, -0.00044, 1.0], [-0.00266, -0.00123, 0.00069, 1.0], [0.0, 0.0, 0.0, 1.0], [-0.00039, 0.00312, 0.00024, 1.0], [3e-05, -1e-05, -1e-05, 1.0], [0.00052, -0.00076, -0.00066, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [-0.00011, 0.00438, 2e-05, 0.99999], [-1e-05, -0.00047, 0.00013, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0012, -0.00148, -0.00064, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00047, 0.00013, 1.0], [2e-05, 5e-05, 8e-05, 1.0], [-0.00598, 0.00193, 0.00025, 0.99998], [-0.00515, -0.00598, 6e-05, 0.99997], [0.0, 0.0, 0.0, 1.0], [0.00255, -0.00135, -0.00061, 1.0], [0.00317, -0.00321, 0.00131, 0.99999], [0.0, 0.0, 0.0, 1.0], [-0.00021, 0.00351, 0.00023, 0.99999], [3e-05, -1e-05, -1e-05, 1.0], [4e-05, 1e-05, -0.00029, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.00043, 0.00432, -0.00028, 0.99999], [-1e-05, -0.00047, 0.00013, 1.0], [0.00601, -0.00012, -0.00417, 0.99997], [0.0019, -0.00165, -0.00081, 1.0], [0.0, 0.0, 0.0, 1.0], [-1e-05, -0.00047, 0.00013, 1.0], [2e-05, 5e-05, 8e-05, 1.0], [-0.00592, 0.0016, -0.00023, 0.99998], [-0.00564, -0.00685, -0.00145, 0.99996], [0.0, 0.0, 0.0, 1.0], [0.00377, -0.00174, -0.00046, 0.99999], [0.00391, -0.00301, 0.0022, 0.99999], [0.0, 0.0, 0.0, 1.0], [-0.00021, 0.0033, 0.00026, 0.99999], [3e-05, -1e-05, -1e-05, 1.0], [0.00027, 0.00024, -0.00046, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.00078, 0.00468, -0.00016, 0.99999], [0.00108, 0.00184, 0.00511, 0.99998], [0.00806, -0.00049, -0.00452, 0.99996], [0.00209, -0.00187, -0.00088, 1.0], [0.0, 0.0, 0.0, 1.0], [2e-05, -0.00043, 9e-05, 1.0], [2e-05, 5e-05, 8e-05, 1.0], [-0.00606, 0.00152, -0.00045, 0.99998], [-0.00633, -0.00668, -0.0025, 0.99995], [0.0, 0.0, 0.0, 1.0], [0.00429, -0.00199, -0.00114, 0.99999], [0.00455, -0.00302, 0.001, 0.99998], [0.0, 0.0, 0.0, 1.0], [-0.00081, 0.00258, 0.0047, 0.99999], [3e-05, -1e-05, -1e-05, 1.0], [0.00099, -0.00098, -0.00089, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.0009, 0.00477, -0.0001, 0.99999], [-0.00105, 0.00245, 0.00135, 1.0], [0.00812, -0.00052, -0.00459, 0.99996], [0.00217, -0.00193, -0.00091, 1.0], [0.0, 0.0, 0.0, 1.0], [0.00108, -0.0003, -6e-05, 1.0], [2e-05, 5e-05, 8e-05, 1.0], [-0.00604, 0.00148, -0.00056, 0.99998], [-0.0062, -0.00677, -0.0026, 0.99995], [0.0, 0.0, 0.0, 1.0], [0.00445, -0.00204, -0.00117, 0.99999], [0.00467, -0.00311, 0.00069, 0.99998], [0.0, 0.0, 0.0, 1.0], [-0.00091, 0.00333, 0.00545, 0.99998], [3e-05, -1e-05, -1e-05, 1.0], [-0.0005, -0.00107, -0.00153, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.00136, 0.00444, 0.00048, 0.99999], [-0.00497, 0.00244, -0.00096, 0.99998], [0.00941, -0.00072, -0.00613, 0.99994], [0.00244, -0.00181, -0.00099, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.00183, 0.00035, -0.00042, 1.0], [2e-05, 5e-05, 8e-05, 1.0], [-0.00651, 0.00159, -0.00042, 0.99998], [-0.00761, -0.0064, -0.0023, 0.99995], [0.0, 0.0, 0.0, 1.0], [0.00456, -0.00192, -0.00096, 0.99999], [0.00402, -0.00281, 0.00297, 0.99998], [0.0, 0.0, 0.0, 1.0], [-0.00216, 0.00345, 0.00601, 0.99997], [3e-05, -1e-05, -1e-05, 1.0], [-0.00357, -0.00095, -0.0021, 0.99999], [-0.00359, -0.00066, 0.00488, 0.99998]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]], [[0.0, 0.0, 0.0, 1.0], [0.00269, 0.0046, 0.00223, 0.99998], [-0.01128, 0.00262, -0.00081, 0.99993], [0.01076, -0.00014, -0.00727, 0.99992], [0.00248, -0.00137, -0.00147, 0.99999], [0.0, 0.0, 0.0, 1.0], [0.0037, 0.00116, 0.00297, 0.99999], [5e-05, 8e-05, 4e-05, 1.0], [-0.00754, 0.00169, 0.00027, 0.99997], [-0.01134, -0.00509, 0.00167, 0.99992], [0.0, 0.0, 0.0, 1.0], [0.00522, -0.00242, 7e-05, 0.99998], [0.00286, -0.00264, 0.00739, 0.99997], [0.00817, -0.00091, 0.01696, 0.99982], [-0.00429, 0.00372, 0.007, 0.99996], [3e-05, -1e-05, -1e-05, 1.0], [-0.00714, -0.00095, -0.00168, 0.99997], [-0.00793, -0.00136, 0.00704, 0.99994]]], "filename": "Bottom.bag.E", "states": [[[-0.6482, 0.07573, -0.20541], [0.06295, 0.07188, -0.00878], [-0.08044, 0.07115, -0.91225], [-0.22431, 0.07573, -0.57606], [0.25165, 0.07143, -0.62742], [-0.72426, 0.07573, 0.48707], [-0.14757, 0.07115, -0.08424], [-0.65151, 0.07177, -0.74344], [0.5899, 0.06999, -0.47174], [0.34985, 0.07189, 0.30006], [-0.46373, 0.07573, 0.16984], [0.513, 0.07573, -0.08493], [0.77417, 0.07214, 0.26223], [0.4, 0.07573, 0.6], [0.78151, 0.07573, -0.72201], [-0.34346, 0.07388, -0.81464], [0.03262, 0.072, -0.47568], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.06295, 0.07188, -0.00878], [-0.08044, 0.07115, -0.91225], [-0.22431, 0.07573, -0.57606], [0.25165, 0.07143, -0.62742], [-0.72426, 0.07573, 0.48707], [-0.14757, 0.07115, -0.08424], [-0.65151, 0.07177, -0.74344], [0.5108, 0.07172, -0.23389], [0.34985, 0.07189, 0.30006], [-0.46373, 0.07573, 0.16984], [0.513, 0.07574, -0.08492], [0.77417, 0.07214, 0.26223], [0.4, 0.07573, 0.6], [0.78151, 0.07573, -0.72201], [-0.34346, 0.07388, -0.81464], [0.03262, 0.072, -0.47568], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.06295, 0.07188, -0.00878], [-0.08044, 0.07115, -0.91225], [-0.22431, 0.07573, -0.57606], [0.36256, 0.07202, -0.09168], [-0.72426, 0.07573, 0.48707], [-0.14757, 0.07115, -0.08424], [-0.65151, 0.07177, -0.74344], [0.51081, 0.0721, -0.23389], [0.34985, 0.07189, 0.30006], [-0.46373, 0.07573, 0.16984], [0.51301, 0.07575, -0.08491], [0.77417, 0.07214, 0.26223], [0.4, 0.07573, 0.6], [0.78151, 0.07573, -0.72201], [-0.34346, 0.07388, -0.81464], [0.03262, 0.072, -0.47568], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.06299, 0.07212, -0.00877], [-0.08036, 0.07197, -0.91223], [-0.22431, 0.07573, -0.57606], [0.36243, 0.07236, -0.09084], [-0.72426, 0.07573, 0.48707], [-0.14749, 0.07197, -0.08422], [-0.65149, 0.0721, -0.74343], [0.51083, 0.0722, -0.23387], [0.34989, 0.07213, 0.30007], [-0.46373, 0.07573, 0.16984], [0.51301, 0.07577, -0.08486], [0.77419, 0.07218, 0.26224], [0.4, 0.07573, 0.6], [0.78151, 0.07573, -0.72201], [-0.34346, 0.07388, -0.81464], [0.35682, 0.07198, -0.23669], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21278, 0.07217, -0.0947], [-0.08036, 0.07197, -0.91223], [-0.22431, 0.07573, -0.57606], [0.36235, 0.07247, -0.09048], [-0.72426, 0.07573, 0.48707], [-0.14749, 0.07197, -0.08422], [-0.65149, 0.0721, -0.74343], [0.51084, 0.0722, -0.23386], [0.34989, 0.07213, 0.30007], [-0.46373, 0.07573, 0.16984], [0.51303, 0.07577, -0.08482], [0.77419, 0.07218, 0.26224], [0.4, 0.07573, 0.6], [0.78151, 0.07573, -0.72201], [-0.34346, 0.07388, -0.81464], [0.35775, 0.07222, -0.23764], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21241, 0.07237, -0.09351], [-0.08036, 0.07197, -0.91223], [-0.22431, 0.07573, -0.57606], [0.36239, 0.07249, -0.09038], [-0.72426, 0.07573, 0.48707], [-0.14749, 0.07197, -0.08422], [-0.65149, 0.0721, -0.74343], [0.51085, 0.0722, -0.23385], [0.34989, 0.07213, 0.30007], [-0.46373, 0.07573, 0.16984], [0.51305, 0.07577, -0.08479], [0.77419, 0.07218, 0.26224], [0.4, 0.07573, 0.6], [0.20349, 0.07185, -0.23966], [-0.34346, 0.07388, -0.81464], [0.35808, 0.07227, -0.23764], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21204, 0.07249, -0.09298], [-0.08032, 0.07214, -0.91222], [-0.22431, 0.07573, -0.57606], [0.36239, 0.0725, -0.09029], [-0.72426, 0.07573, 0.48707], [-0.14745, 0.07214, -0.08421], [-0.65146, 0.07217, -0.74342], [0.51113, 0.07244, -0.23447], [0.34991, 0.07217, 0.30008], [-0.46373, 0.07573, 0.16984], [0.51305, 0.0756, -0.0845], [0.51712, 0.20852, -0.08893], [0.4, 0.07573, 0.6], [0.20368, 0.07215, -0.2401], [-0.34346, 0.07388, -0.81464], [0.35844, 0.07229, -0.23777], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21183, 0.07252, -0.09285], [-0.0803, 0.07218, -0.91221], [-0.22431, 0.07573, -0.57606], [0.36227, 0.07254, -0.09029], [-0.72426, 0.07573, 0.48707], [-0.14743, 0.07218, -0.0842], [-0.65144, 0.07219, -0.74342], [0.51198, 0.07287, -0.235], [0.51027, 0.21994, -0.23138], [-0.46373, 0.07573, 0.16984], [0.51304, 0.07571, -0.08359], [0.51658, 0.22267, -0.08483], [0.4, 0.07573, 0.6], [0.20373, 0.0722, -0.24017], [-0.34346, 0.07388, -0.81464], [0.35846, 0.07226, -0.23808], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21184, 0.07257, -0.09279], [-0.0803, 0.07218, -0.91221], [0.35325, 0.22222, -0.08853], [0.36228, 0.07257, -0.0902], [-0.72426, 0.07573, 0.48707], [-0.14743, 0.07218, -0.0842], [-0.65144, 0.07219, -0.74342], [0.51214, 0.07298, -0.23505], [0.5108, 0.22048, -0.23173], [-0.46373, 0.07573, 0.16984], [0.51304, 0.07568, -0.08333], [0.51586, 0.2231, -0.08395], [0.4, 0.07573, 0.6], [0.20389, 0.0722, -0.24031], [-0.34346, 0.07388, -0.81464], [0.35857, 0.07236, -0.23805], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21165, 0.07266, -0.09266], [0.34751, 0.21863, -0.2455], [0.35335, 0.22233, -0.08775], [0.36227, 0.07263, -0.09008], [-0.72426, 0.07573, 0.48707], [-0.13535, 0.07219, -0.0842], [-0.65144, 0.07219, -0.74342], [0.51226, 0.07301, -0.23507], [0.51138, 0.22072, -0.23208], [-0.46373, 0.07573, 0.16984], [0.51297, 0.07579, -0.08336], [0.51592, 0.22339, -0.08361], [0.4, 0.07573, 0.6], [0.20306, 0.0726, -0.24044], [-0.34346, 0.07388, -0.81464], [0.35843, 0.0725, -0.23824], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21166, 0.07268, -0.09266], [0.34875, 0.21944, -0.24639], [0.35341, 0.22234, -0.08776], [0.36228, 0.07265, -0.09009], [-0.72426, 0.07573, 0.48707], [0.20486, 0.20971, -0.09179], [-0.65144, 0.07219, -0.74342], [0.51229, 0.07305, -0.23506], [0.51152, 0.22077, -0.2321], [-0.46373, 0.07573, 0.16984], [0.51298, 0.07579, -0.08334], [0.51595, 0.22344, -0.08351], [0.4, 0.07573, 0.6], [0.20296, 0.07278, -0.24053], [-0.34346, 0.07388, -0.81464], [0.35864, 0.07244, -0.23831], [-0.20258, 0.07573, 0.34728]], [[-0.6482, 0.07573, -0.20541], [0.21165, 0.07269, -0.09267], [0.34947, 0.21978, -0.24821], [0.35385, 0.22253, -0.08753], [0.36227, 0.07269, -0.09013], [-0.72426, 0.07573, 0.48707], [0.20489, 0.21839, -0.0915], [-0.65144, 0.07219, -0.74342], [0.51232, 0.07307, -0.23514], [0.51153, 0.22082, -0.2327], [-0.46373, 0.07573, 0.16984], [0.51298, 0.07579, -0.08335], [0.5151, 0.22355, -0.08371], [0.4, 0.07573, 0.6], [0.20306, 0.07301, -0.24113], [-0.34346, 0.07388, -0.81464], [0.35881, 0.07246, -0.23854], [0.19977, 0.21941, -0.24692]], [[-0.6482, 0.07573, -0.20541], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [-0.72426, 0.07573, 0.48707], [0.20343, 0.21998, -0.09049], [-0.65143, 0.0722, -0.74343], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [-0.46373, 0.07573, 0.16984], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.50735, 0.37286, -0.15438], [0.2034, 0.07306, -0.24155], [-0.34346, 0.07388, -0.81464], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]], [[-0.6482, 0.07573, -0.20541], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [-0.72426, 0.07573, 0.48707], [0.20343, 0.21998, -0.09049], [-0.65143, 0.0722, -0.74343], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [0.20894, 0.37973, -0.16995], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.50735, 0.37286, -0.15438], [0.2034, 0.07306, -0.24155], [-0.34346, 0.07388, -0.81464], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]], [[-0.6482, 0.07573, -0.20541], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [-0.72426, 0.07573, 0.48707], [0.20343, 0.21998, -0.09049], [0.23633, 0.53868, -0.17245], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [0.20894, 0.37973, -0.16995], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.50735, 0.37286, -0.15438], [0.2034, 0.07306, -0.24155], [-0.34346, 0.07388, -0.81464], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]], [[-0.6482, 0.07573, -0.20541], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [-0.72426, 0.07573, 0.48707], [0.20343, 0.21998, -0.09049], [0.23633, 0.53868, -0.17245], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [0.20894, 0.37973, -0.16995], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.5076, 0.37286, -0.14707], [0.2034, 0.07306, -0.24155], [0.45864, 0.5402, -0.1583], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]], [[-0.48591, 0.07573, -0.09451], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [0.26365, 0.71276, -0.19827], [0.20343, 0.21998, -0.09049], [0.23633, 0.53868, -0.17245], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [0.20894, 0.37973, -0.16995], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.5076, 0.37286, -0.14707], [0.2034, 0.07306, -0.24155], [0.45864, 0.5402, -0.1583], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]], [[0.41839, 0.70261, -0.18458], [0.21131, 0.07275, -0.09252], [0.34976, 0.21994, -0.251], [0.35391, 0.22253, -0.08725], [0.36218, 0.07274, -0.09014], [0.26365, 0.71276, -0.19827], [0.20343, 0.21998, -0.09049], [0.23633, 0.53868, -0.17245], [0.51239, 0.07314, -0.23535], [0.51123, 0.22083, -0.23442], [0.20894, 0.37973, -0.16995], [0.51303, 0.07574, -0.08336], [0.51401, 0.22385, -0.08428], [0.5076, 0.37286, -0.14707], [0.2034, 0.07306, -0.24155], [0.45864, 0.5402, -0.1583], [0.35897, 0.07258, -0.23883], [0.19956, 0.2202, -0.24969]]], "images": ["Bottom.bag.E_00.png", "Bottom.bag.E_01.png", "Bottom.bag.E_02.png", "Bottom.bag.E_03.png", "Bottom.bag.E_04.png", "Bottom.bag.E_05.png", "Bottom.bag.E_06.png", "Bottom.bag.E_07.png", "Bottom.bag.E_08.png", "Bottom.bag.E_09.png", "Bottom.bag.E_10.png", "Bottom.bag.E_11.png", "Bottom.bag.E_12.png", "Bottom.bag.E_13.png", "Bottom.bag.E_14.png", "Bottom.bag.E_15.png", "Bottom.bag.E_16.png", "Bottom.bag.E_17.png"], "side_length": 0.1524}
