{"shape_params": ["blue", "green", "cyan", "magenta", "yellow", "red"], "decoration": "logo", "notes": [{"start": 0, "notes": ["Rotate Coca-Cola right, and place Burger King at the center of the grid.", "Turn Coca-Cola a quarter turn right, and move Burger King two spaces northwest of it.", "Coca cola's back right corner remains steady while the rest moves to the right. Burger King slides southwest.", "Turn Coca Cola slightly to the right.  Slide Burger King to the front one block length.", "Move Burger King so it is halfway between BMW and Coca Cola. Turn Coca Cola 30 degrees to the right.", "Coca Cola's back face should be facing north-northeast.  Burger King should be one block south.", "Place the Burger King block between the BMW and Coca Cola blocks equidistantly. Twist the Burger King block counterclockwise ten degrees and the Coca Cola block clockwise ten degrees.", "Turn the Burger King block counterclockwise ten degrees. Turn the Coca Cola block clockwise ten degrees. Slide the Burger King block down until it is between the BMW and Coca Cola blocks.", "Imagine there is a line between the BMW and Coca Cola blocks. Slide the Burger King block down until it is on that line. Then twist the Burger King block counterclockwise about ten degrees. Do the same to the Coca Cola block, except you should twist it clockwise."], "finish": 1, "type": "A0", "users": ["A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF"]}, {"start": 1, "notes": ["Place BMW two spaces down and rotate to the left. Rotate Esso right.", "Place BMW one and a half spaces northeast of Adidas and tilt it left. Tilt Esso right.", "BMW moves down so it is a mirror of Coca-Cola around BMW. Esso rotates a quarter turn right.", "Slide BMW to the front two block lengths. Turn Esso slightly to the right.", "Move BMW forward two block lengths and turn it 30 degrees to theleft. Turn Esso 45 degrees to the right.", "BMW should be two blocks lengths south and its back face should face north-northwest. Esso's back face should face northeast.", "Slide the BMW block down until it is about a block away from the Adidas block. Twist the BMW block counterclockwise about ten degrees. Twist the Esso block clockwise about 45 degrees.", "Turn the BMW block counterclockwise ten degrees. Turn the Esso block clockwise about 45 degrees. Slide the BMW block down until it is just about in line with the Coca Cola block.", "Imagine there is a line between the Burger King and Adidas blocks. Slide the BMW block down until it is on that line. Then twist the BMW block counterclockwise about ten degrees. Twist the Esso block clockwise about 45 degrees."], "finish": 2, "type": "A0", "users": ["A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF"]}, {"start": 2, "notes": ["Move Esso two spaces left.", "Esso moves two spaces closer to BMW while Adidas rotates right.", "Esso will be two spaces southwest, curved, of Coca-Cola, while Adidas tilts slightly right.", "Slide Esso one block length to the left and one block length back. Turn Adidas slightly to the right.", "Move Esso one block length closer to the other blocks. Turn Adidas 30 degrees to the right.", "Esso should go one block length northwest. Adidas's back face should face north-northeast.", "Twist the Adidas block clockwise about 10 degrees. Slide the Esso block to the left until it is in line with the Coca Cola block.", "Move the Esso block to the left until it is in line with the Coca Cola block. Turn the Adidas block clockwise about ten degrees.", "Turn the Adidas block clockwise about 10 degrees and then move the Esso block to the left until it is under the Coca Cola block."], "finish": 3, "type": "A0", "users": ["A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF"]}, {"start": 3, "notes": ["Last, move Adidas right until creating an equidistant circle with the blocks.", "Last, move Adidas so all five boxes form a human shape (head, hands, feet)", "Last, Adidas moves a space down and right.", "Slide Adidas to the right one block length.", "Move Adidas to the right slightly so that it creates a circle out of the  5 blocks.", "Adidas should move north-northeast one block length. You've made a pentagon out of blocks.", "Move the Adidas block down and to the right until it is slightly right of the BMW block and slightly out of line with the Esso block.", "Move the Adidas block to the right until it is a little further right than the BMW block. Slide the Adidas block down until it is a little further down than the Esso block.", "Move the Adidas block down until it is slightly further down than the Esso block, then move it to the right until it is a bit further to the right than the BMW block."], "finish": 4, "type": "A0", "users": ["A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A11QDNT3W7DT7K", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "A3SDFAOJW87FGP", "AR22D9E55HQBF", "AR22D9E55HQBF", "AR22D9E55HQBF"]}], "rotations": [[[0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.0, 0.0, 1.0], [0.0, 0.08716, 0.0, 0.99619], [0.0, 0.0, 0.0, 1.0]], [[0.0, 0.0, 0.0, 1.0], [0.0, 0.64279, 0.0, 0.76604], [0.0, 0.0, 0.0, 1.0], [0.0, 0.08716, 0.0, 0.99619], [0.0, 0.34202, 0.0, 0.93969]], [[0.0, 0.08716, 0.0, 0.99619], [0.0, 0.64279, 0.0, 0.76604], [0.0, 0.0, 0.0, 1.0], [0.0, 0.08716, 0.0, 0.99619], [0.0, 0.34202, 0.0, 0.93969]], [[0.0, 0.08716, 0.0, 0.99619], [0.0, 0.64279, 0.0, 0.76604], [0.0, 0.0, 0.0, 1.0], [0.0, 0.08716, 0.0, 0.99619], [0.0, 0.34202, 0.0, 0.93969]]], "filename": "clean.ID092_92", "states": [[[-0.45648, 0.1524, -0.64675], [-0.48757, 0.1524, 0.08555], [0.1082, 0.1524, 0.29997], [0.31467, 0.1524, -0.22581], [0.58523, 0.1524, -0.72841]], [[-0.45648, 0.1524, -0.64675], [-0.48757, 0.1524, 0.08555], [-0.01628, 0.1524, -0.02411], [0.31467, 0.1524, -0.22581], [0.58523, 0.1524, -0.72841]], [[-0.45648, 0.1524, -0.64675], [-0.37608, 0.1524, -0.28035], [-0.01628, 0.1524, -0.02411], [0.35824, 0.1524, -0.23686], [0.58523, 0.1524, -0.72841]], [[-0.45648, 0.1524, -0.64675], [-0.37608, 0.1524, -0.28035], [-0.01628, 0.1524, -0.02411], [0.35824, 0.1524, -0.23686], [0.24596, 0.1524, -0.66973]], [[-0.25222, 0.1524, -0.71741], [-0.37608, 0.1524, -0.28035], [-0.01628, 0.1524, -0.02411], [0.35824, 0.1524, -0.23686], [0.24596, 0.1524, -0.66973]]], "images": ["clean.ID092_92_00.png", "clean.ID092_92_01.png", "clean.ID092_92_02.png", "clean.ID092_92_03.png", "clean.ID092_92_04.png"], "side_length": 0.1524}
